// Домашка03.01 -Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом. 
//Задание должно быть выполнено в методе. В методе не должно быть вывода в консоль. Не использовать String!

//Домашка03.02-Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве. 
//Задание должно быть выполнено в методе. В методе не должно быть вывода в консоль.
/*
double WC ()
{
    Console.WriteLine("Ваше число");
    bool isParsed = double.TryParse(Console.ReadLine(), out double num);
    if (isParsed)
    {
        return num;
    }
    else
    {
        Console.WriteLine("Введенные символы,не являются верными в данном контексте");
        return num = double.Parse(Console.ReadLine());
    }
}

double a1 = WC();
double a2 = WC();
double a3 = WC();
double b1 = WC();
double b2 = WC();
double b3 = WC();

double ab = Math.Sqrt((b1-a1)*(b1-a1) + (b2-a2)*(b2-a2) + (b3-a3)*(b3-a3));
Console.WriteLine(ab);
*/

//Домашка03.03-Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N. 
//Задание должно быть выполнено в методе и метод должен вернуть массив чисел.