// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.

// Console.WriteLine("Какой длины будет массив?");
// int arrLentgth = int.Parse(Console.ReadLine());
// int[] Array = new int[arrLentgth];
// int i = 0;
// while (i < arrLentgth)
// {
//     Console.Write($"Введите {i + 1} число: ");
//     Array[i] = int.Parse(Console.ReadLine());
//     i++;
// }
// int count = 0;
// for(i = 0; i < Array.Length; i++)
// {
//     if(Array[i]>0)
//     {
//         count+=1;
//     }
// }
// System.Console.WriteLine(count);
// System.Console.WriteLine('[' + string.Join("• ", Array) + ']');

//Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; 
//значения b1, k1, b2 и k2 задаются пользователем.

